/*
【问题描述】

解一元二次方程ax2+bx+c=0，参数a、b、c由键盘输入。

分析：对系数a、b、c考虑以下情形

1) 若a == 0 ：

   ① b != 0，则 x = -c/b；

   ② b = 0，则：①c = 0， 则x 无定根；

            	②c != 0，则x 无解。

2) 若a != 0 ：

   ① b2-4ac > 0，有两个不等的实根；

   ② b2-4ac = 0，有两个相等的实根；

   ③ b2-4ac < 0，有两个共轭复根。



【输入形式】按顺序从键盘输入3个正整数a,b,c，中间用英文的逗号分隔开。例如：1.0,-5.0,6.0

【输出形式】输出方程的解（精确到小数点后面3位），若有多个解，需要分行输出。

 【样例输入】1.0,-5.0,6.0

【样例输出】

2.000

3.000
*/
#include<stdio.h>
#include<math.h> 
int main()
{
	float a,b,c,d,x1,x2;
	scanf("%f,%f,%f",&a,&b,&c);
	d=b*b-4*a*c;
	if(a==0) 
	{
		if(b!=0)
		{
			x1=(-c/b);
			printf("%d",x1);
		}
		if(b==0)
		{
			printf("\n");
		}
	}
	if(a!=0) 
	{
		if (d>=0)
		{
			x1=(-b-sqrt(d))/2*a;
			x2=(-b+sqrt(d))/2*a;
			printf("%.3f\n%.3f",x1,x2);
		}
		if (d<0)
		{
			printf("%.3f+%.3fi\n%.3f-%.3fi\n",(-b)/(2.0*a),sqrt(-d)/(2.0*a),(-b)/(2.0*a),sqrt(-d)/(2.0*a));
		}
	}	
	return 0;
}

