/*4.习题5.8 企业发放的奖金根据利润提成
【问题描述】
企业发放的奖金根据利润(用变量I表示)提成。从键盘输入当月利润I，求应发放奖金总数。要求：(1)用if语句编程序；(2)用switch语句编程序。
I≤100000时，奖金可提成10% ；
100000<I≤200000时，其中10万元按10%提成，高于10万元的部分，可提成7.5% ；
200000<I≤400000时，其中20万元仍按上述办法提成（下同），高于20万元的部分按5%提成；
400000<I≤600000时，高于40万元的部分按3%提成；
600000<I≤1000000时，高于60万的部分按1.5%提成；
I>1000000时，超过100万元的部分按1%提成。 
【输入形式】输入利润I
【输出形式】输出奖金（精确到小数点后面2位）
【样例输入】
6845975
【样例输出】
97959.75*/
#include <stdio.h>
int main() {
	double i; 
	double a1, a2, a4, a6, a10, a; 
	scanf("%lf", &i); 
	a1 = 100000 * 0.1; 
	a2 = a1 + 100000 * 0.075;
	a4 = a2 + 200000 * 0.05;
	a6 = a4 + 200000 * 0.03; 
	a10 = a6 + 400000 * 0.015; 
	if (i <= 100000) {
		a = i * 0.1;
	}
	else if (i <= 200000) {
		a = a1 + (i - 100000) * 0.075; 
	}
	else if (i <= 400000) {
		a = a2 + (i - 200000) * 0.05;
	}
	else  if (i <= 600000) {
		a = a4 + (i - 400000) * 0.03; 
	}
	else if (i <= 1000000) {
		a = a6 + (i - 600000) * 0.015; 
	}
	else if (i > 1000000) {
		a = a10 + (i - 1000000) * 0.01; 
	}
	printf("%.2lf\n", a);
		return 0;
}

