/*
在已经按照由小到大排列的数组a[11]={12,30,48,60,68,87,91,95,97,99} 中插入一个正整数x，x的值由用户输入，要求插入后的数组仍然有序，最后输出该数组。

提示，最后输出的格式统一使用"%d "的形式

【输入形式】一个正整数

【输出形式】输出插入后的有序数组

【样例输入】

77

【样例输出】

12 30 48 60 68 77 87 91 95 97 99 
*/
#include<stdio.h> 
int main()
{
	int a[11]={12,30,48,60,68,87,91,95,97,99};
	int x,i,j;
	scanf("%d",&x);
	a[10]=x;
	for (i = 0; i < 11; i++)
		for (j = 0; j < 10- i; j++)
			if (a[j] > a[j + 1])
			{
				int t;
				t = a[j];
				a[j] = a[j + 1];
				a[j + 1] = t;
			}
	for (i = 0; i < 11; i++)
		printf("%d ", a[i]);
	return 0;
}

